examples/openfoam/example_icoFoamYade/0/alpha
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0] 1;

internalField   uniform 1;

boundaryField
{
    y1
    {
        type            calculated;
        value           uniform 1; 
    }


    y0
    {
        type            calculated;
        value           uniform 1; 
    }


    x0
    {
        type            cyclic;
    }


    x1
    {
        type            cyclic;
    }


    z0
    {
        type            cyclic;
    }



    z1
    {
        type            cyclic;
    }





}

// ************************************************************************* //
